# Day 30 — Outlier Detection & Data Type Optimization

In [14]:

import pandas as pd
import numpy as np

df = pd.read_csv("day_30_orders_dirty.csv")
df

    order_id customer       city  order_amount  quantity
0          1    Aanya      Delhi           500         2
1          2    Meera     Mumbai           650         3
2          3     Riya       Pune           700         4
3          4    Pooja      Delhi           550         2
4          5    Sneha  Bangalore           600         3
5          6      Ira     Mumbai           620         3
6          7    Naina       Pune           580         2
7          8    Kavya      Delhi           590         4
8          9     Diya     Mumbai           610         3
9         10     Tara       Pune           605         2
10        11   Aarohi      Delhi         20000        50
11        12   Ishita     Mumbai           750         3
12        13     Neha       Pune           680         4
13        14    Palak      Delhi           720         3
14        15   Simran     Mumbai         25000        60

## Exercise 1 — IQR Method

In [15]:
# TODO

q1 = df["order_amount"].quantile(0.25)
q3 = df["order_amount"].quantile(0.75)
iqr = q3 - q1

lower = q1 - 1.5*iqr
upper = q3 + 1.5*iqr

outlier_iqr = df[(df["order_amount"] < lower) | (df["order_amount"] > upper)]
outlier_iqr

    order_id customer    city  order_amount  quantity
10        11   Aarohi   Delhi         20000        50
14        15   Simran  Mumbai         25000        60

## Exercise 2 — Z-score Method

In [16]:
mean = df["quantity"].mean()
std = df["quantity"].std()

df["z_score"] = (df["quantity"] - mean) / std

outliers_z = df[df["z_score"].abs() > 3]
outliers_z

Empty DataFrame
Columns: [order_id, customer, city, order_amount, quantity, z_score]
Index: []

## Exercise 3 — Handle Outliers

In [17]:
# TODO

df["order_amount"] = df["order_amount"].clip(lower, upper)
df

    order_id customer       city  order_amount  quantity   z_score
0          1    Aanya      Delhi         500.0         2 -0.426732
1          2    Meera     Mumbai         650.0         3 -0.372486
2          3     Riya       Pune         700.0         4 -0.318240
3          4    Pooja      Delhi         550.0         2 -0.426732
4          5    Sneha  Bangalore         600.0         3 -0.372486
5          6      Ira     Mumbai         620.0         3 -0.372486
6          7    Naina       Pune         580.0         2 -0.426732
7          8    Kavya      Delhi         590.0         4 -0.318240
8          9     Diya     Mumbai         610.0         3 -0.372486
9         10     Tara       Pune         605.0         2 -0.426732
10        11   Aarohi      Delhi         882.5        50  2.177054
11        12   Ishita     Mumbai         750.0         3 -0.372486
12        13     Neha       Pune         680.0         4 -0.318240
13        14    Palak      Delhi         720.0         3 -0.372486
14        15   Simran     Mumbai         882.5        60  2.719509

## Exercise 4 — Optimize Data Types

In [18]:
# TODO

df["city"] = df["city"].astype("category")

df["order_id"] = pd.to_numeric(df["order_id"], downcast = "integer")
df["quantity"] = pd.to_numeric(df["quantity"], downcast = "integer")

df

    order_id customer       city  order_amount  quantity   z_score
0          1    Aanya      Delhi         500.0         2 -0.426732
1          2    Meera     Mumbai         650.0         3 -0.372486
2          3     Riya       Pune         700.0         4 -0.318240
3          4    Pooja      Delhi         550.0         2 -0.426732
4          5    Sneha  Bangalore         600.0         3 -0.372486
5          6      Ira     Mumbai         620.0         3 -0.372486
6          7    Naina       Pune         580.0         2 -0.426732
7          8    Kavya      Delhi         590.0         4 -0.318240
8          9     Diya     Mumbai         610.0         3 -0.372486
9         10     Tara       Pune         605.0         2 -0.426732
10        11   Aarohi      Delhi         882.5        50  2.177054
11        12   Ishita     Mumbai         750.0         3 -0.372486
12        13     Neha       Pune         680.0         4 -0.318240
13        14    Palak      Delhi         720.0         3 -0.372486
14        15   Simran     Mumbai         882.5        60  2.719509